---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterRule
source: html/d88a8221-9a1f-6deb-8530-f5dcada96981.htm
---
# FilterRule Methods

Derived classes override this method to implement the test that determines
 whether the given element passes this rule or not.